# Part 3 Maji Ndogo project: From analysis to action

#### The goals of this part of the project are:

    1. Integrating the auditors report data into our database: an independent auditor was approached to authenticate the water sources, pollution levels and the residents comments on the surveyors conduct

    2.Generating an ERD from the database

    3.Linking records: joining our employee data to the auditor report

    4. Seeking the truth: bulding a complex query to investigate employee corruption

In [1]:
# load sql extension for magic commands
%load_ext sql

In [2]:
# connect to mysql database 
%sql mysql+pymysql://root:12345678@localhost:3306/md_water_services

Connecting to 'mysql+pymysql://root:***@localhost:3306/md_water_services'

In [3]:
%sql SHOW TABLES

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

11 rows affected.

+-----------------------------+
| Tables_in_md_water_services |
+-----------------------------+
|        auditor_report       |
|   combined_analysis_table   |
|       data_dictionary       |
|           employee          |
|     global_water_access     |
|      incorrect_records      |
|           location          |
|            visits           |
|        water_quality        |
|         water_source        |
+-----------------------------+
Truncated to displaylimit of 10.

to verify the authenticity of the database, an audit was commisioned and the finding recorded in the auditor_report table. The auditors report records verified type of water source with its verified water source score as well as its location id. the auditor also included a column on remarks of the residents about the conduct of the surveyors.

In [5]:
%%sql
SELECT
    *
FROM
    auditor_report
LIMIT
    3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+-------------+----------------------+-------------------------+-------------------------------------------------------------------------------------------------------------------------------------------+
| location_id | type_of_water_source | true_water_source_score |                                                                 statements                                                                |
+-------------+----------------------+-------------------------+-------------------------------------------------------------------------------------------------------------------------------------------+
|  SoRu34980  |         well         |            1            |          Residents admired the official's commitment to enhancing urban life, praising their cooperative and inclusive approach.          |
|  AkRu08112  |         well         |            3            | Villagers spoke highly of the official's dedication and genuine interest in their lives, fostering a sense of belonging and appreciation. |
|  AkLu02044  |        river         |            0            |         Villagers were touched by the official's interactions, noting their humility, strong work ethic, and respectful attitude.         |
+-------------+----------------------+-------------------------+-------------------------------------------------------------------------------------------------------------------------------------------+

In [6]:
%%sql
    -- select the water_quality table
SELECT
    *
FROM
    water_quality
LIMIT
    3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+-----------+--------------------------+-------------+
| record_id | subjective_quality_score | visit_count |
+-----------+--------------------------+-------------+
|     0     |            0             |      1      |
|     1     |            1             |      1      |
|     2     |            5             |      1      |
+-----------+--------------------------+-------------+

In [7]:
%%sql
    -- select the water_source table also 
SELECT
    *
FROM
    water_source
LIMIT
    2;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+--------------+----------------------+-------------------------+
|  source_id   | type_of_water_source | number_of_people_served |
+--------------+----------------------+-------------------------+
| AkHa00000224 |     tap_in_home      |           956           |
| AkHa00001224 |  tap_in_home_broken  |           930           |
+--------------+----------------------+-------------------------+

In [8]:
%%sql
SELECT
    *
FROM
    location
LIMIT 
    2;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+-------------+---------------------+---------------+-----------+---------------+
| location_id |       address       | province_name | town_name | location_type |
+-------------+---------------------+---------------+-----------+---------------+
|  AkHa00000  |  2 Addis Ababa Road |     Akatsi    |   Harare  |     Urban     |
|  AkHa00001  | 10 Addis Ababa Road |     Akatsi    |   Harare  |     Urban     |
+-------------+---------------------+---------------+-----------+---------------+

~ the 3 tables(water_source, water_quality and location), formed part features that were subject to review in the auditors report.
~ from the information on the auditors report we need to answer the following questions:
 1. Is there a difference in the scores?
 2. If so, are there patterns?

In [14]:
%%sql
    --first lets join the auditors table to the vists based on common location id
SELECT
    a.location_id AS audit_location,
    a.true_water_source_score,
    v.record_id,
    v.location_id AS visit_location
FROM
     auditor_report a
LEFT JOIN
    visits v
    ON a.location_id = v.location_id;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2698 rows affected.

+----------------+-------------------------+-----------+----------------+
| audit_location | true_water_source_score | record_id | visit_location |
+----------------+-------------------------+-----------+----------------+
|   SoRu34980    |            1            |    5185   |   SoRu34980    |
|   AkRu08112    |            3            |   59367   |   AkRu08112    |
|   AkLu02044    |            0            |   37379   |   AkLu02044    |
|   AkHa00421    |            3            |   51627   |   AkHa00421    |
|   SoRu35221    |            0            |   28758   |   SoRu35221    |
|   HaAm16170    |            1            |   31048   |   HaAm16170    |
|   AkRu04812    |            3            |    1513   |   AkRu04812    |
|   AkRu08304    |            3            |    1218   |   AkRu08304    |
|   AkRu05107    |            2            |    8322   |   AkRu05107    |
|   AkRu05215    |            3            |   21160   |   AkRu05215    |
+----------------+-------------------------+-----------+----------------+
Truncated to displaylimit of 10.

In [16]:
%%sql
    -- retrive the subjective quality score from the water_quality table and add to the join above
SELECT
    a.location_id AS audit_location,
    a.true_water_source_score,
    v.record_id,
    v.location_id AS visit_location,
    q.subjective_quality_score
FROM
    auditor_report a
LEFT JOIN
    visits v 
    ON a.location_id = v.location_id
LEFT JOIN
    water_quality q 
    ON v.record_id = q.record_id;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2698 rows affected.

+----------------+-------------------------+-----------+----------------+--------------------------+
| audit_location | true_water_source_score | record_id | visit_location | subjective_quality_score |
+----------------+-------------------------+-----------+----------------+--------------------------+
|   SoRu34980    |            1            |    5185   |   SoRu34980    |            1             |
|   AkRu08112    |            3            |   59367   |   AkRu08112    |            3             |
|   AkLu02044    |            0            |   37379   |   AkLu02044    |            0             |
|   AkHa00421    |            3            |   51627   |   AkHa00421    |            3             |
|   SoRu35221    |            0            |   28758   |   SoRu35221    |            0             |
|   HaAm16170    |            1            |   31048   |   HaAm16170    |            1             |
|   AkRu04812    |            3            |    1513   |   AkRu04812    |            3             |
|   AkRu08304    |            3            |    1218   |   AkRu08304    |            3             |
|   AkRu05107    |            2            |    8322   |   AkRu05107    |            2             |
|   AkRu05215    |            3            |   21160   |   AkRu05215    |            10            |
+----------------+-------------------------+-----------+----------------+--------------------------+
Truncated to displaylimit of 10.

In [20]:
%%sql
    -- lets make the selection lean by dropping 1 location id and renaming some features to make the info clear
SELECT
    a.location_id,
    v.record_id,
    q.subjective_quality_score AS surveyor_score,
    a.true_water_source_score AS auditor_score --renamed
FROM
    auditor_report a
LEFT JOIN
    visits v 
    ON a.location_id = v.location_id
LEFT JOIN
    water_quality q 
    ON v.record_id = q.record_id;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2698 rows affected.

+-------------+-----------+----------------+---------------+
| location_id | record_id | surveyor_score | auditor_score |
+-------------+-----------+----------------+---------------+
|  SoRu34980  |    5185   |       1        |       1       |
|  AkRu08112  |   59367   |       3        |       3       |
|  AkLu02044  |   37379   |       0        |       0       |
|  AkHa00421  |   51627   |       3        |       3       |
|  SoRu35221  |   28758   |       0        |       0       |
|  HaAm16170  |   31048   |       1        |       1       |
|  AkRu04812  |    1513   |       3        |       3       |
|  AkRu08304  |    1218   |       3        |       3       |
|  AkRu05107  |    8322   |       2        |       2       |
|  AkRu05215  |   21160   |       10       |       3       |
+-------------+-----------+----------------+---------------+
Truncated to displaylimit of 10.

check whether the surveyors score is equal to the auditors score

In [23]:
%%sql
    -- use the where clause to filter out the rows where the surveyor_score <> auditor_score
SELECT
    a.location_id,
    v.record_id,
    q.subjective_quality_score AS surveyor_score,
    a.true_water_source_score AS auditor_score --renamed
FROM
    auditor_report a
LEFT JOIN
    visits v 
    ON a.location_id = v.location_id
LEFT JOIN
    water_quality q 
    ON v.record_id = q.record_id
WHERE 
   q.subjective_quality_score = a.true_water_source_score
  ;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2505 rows affected.

+-------------+-----------+----------------+---------------+
| location_id | record_id | surveyor_score | auditor_score |
+-------------+-----------+----------------+---------------+
|  SoRu34980  |    5185   |       1        |       1       |
|  AkRu08112  |   59367   |       3        |       3       |
|  AkLu02044  |   37379   |       0        |       0       |
|  AkHa00421  |   51627   |       3        |       3       |
|  SoRu35221  |   28758   |       0        |       0       |
|  HaAm16170  |   31048   |       1        |       1       |
|  AkRu04812  |    1513   |       3        |       3       |
|  AkRu08304  |    1218   |       3        |       3       |
|  AkRu05107  |    8322   |       2        |       2       |
|  HaDe16541  |   13070   |       2        |       2       |
+-------------+-----------+----------------+---------------+
Truncated to displaylimit of 10.

In [24]:
%%sql
    -- remove the duplicates i.e. where visits >1
SELECT
    a.location_id,
    v.record_id,
    q.subjective_quality_score AS surveyor_score,
    a.true_water_source_score AS auditor_score --renamed
FROM
    auditor_report a
LEFT JOIN
    visits v 
    ON a.location_id = v.location_id
LEFT JOIN
    water_quality q 
    ON v.record_id = q.record_id
WHERE 
   q.subjective_quality_score = a.true_water_source_score
   AND v.visit_count =1;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1518 rows affected.

+-------------+-----------+----------------+---------------+
| location_id | record_id | surveyor_score | auditor_score |
+-------------+-----------+----------------+---------------+
|  SoRu34980  |    5185   |       1        |       1       |
|  AkRu08112  |   59367   |       3        |       3       |
|  AkLu02044  |   37379   |       0        |       0       |
|  AkHa00421  |   51627   |       3        |       3       |
|  SoRu35221  |   28758   |       0        |       0       |
|  HaAm16170  |   31048   |       1        |       1       |
|  AkRu04812  |    1513   |       3        |       3       |
|  AkRu08304  |    1218   |       3        |       3       |
|  AkRu05107  |    8322   |       2        |       2       |
|  HaDe16541  |   13070   |       2        |       2       |
+-------------+-----------+----------------+---------------+
Truncated to displaylimit of 10.

In [25]:
%%sql
    -- check for the incorrect scores
SELECT
    a.location_id,
    v.record_id,
    q.subjective_quality_score AS surveyor_score,
    a.true_water_source_score AS auditor_score --renamed
FROM
    auditor_report a
LEFT JOIN
    visits v 
    ON a.location_id = v.location_id
LEFT JOIN
    water_quality q 
    ON v.record_id = q.record_id
WHERE 
   q.subjective_quality_score <> a.true_water_source_score
   AND v.visit_count =1;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

102 rows affected.

+-------------+-----------+----------------+---------------+
| location_id | record_id | surveyor_score | auditor_score |
+-------------+-----------+----------------+---------------+
|  AkRu05215  |   21160   |       10       |       3       |
|  KiRu29290  |    7938   |       10       |       3       |
|  KiHa22748  |   43140   |       10       |       9       |
|  SoRu37841  |   18495   |       10       |       6       |
|  KiRu27884  |   33931   |       10       |       1       |
|  KiZu31170  |   17950   |       10       |       9       |
|  KiZu31370  |   36864   |       10       |       3       |
|  AkRu06495  |   45924   |       10       |       2       |
|  HaRu17528  |   30524   |       10       |       1       |
|  SoRu38331  |   13192   |       10       |       3       |
+-------------+-----------+----------------+---------------+
Truncated to displaylimit of 10.

In [34]:
%%sql
    -- check for the type of source for the incorrect records using the water_source table
SELECT
    a.location_id,
    v.record_id,
    s.type_of_water_source AS surveyor_source,
    a.type_of_water_source AS auditor_source,
    q.subjective_quality_score AS surveyor_score,
    a.true_water_source_score AS auditor_score --renamed
FROM
    auditor_report a
LEFT JOIN
    visits v 
    ON a.location_id = v.location_id
LEFT JOIN
    water_quality q 
    ON v.record_id = q.record_id
LEFT JOIN
    water_source s
    ON s.source_id = v.source_id	
WHERE 
   q.subjective_quality_score <> a.true_water_source_score
   AND v.visit_count =1;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

102 rows affected.

+-------------+-----------+--------------------+--------------------+----------------+---------------+
| location_id | record_id |  surveyor_source   |   auditor_source   | surveyor_score | auditor_score |
+-------------+-----------+--------------------+--------------------+----------------+---------------+
|  AkRu05215  |   21160   |        well        |        well        |       10       |       3       |
|  KiRu29290  |    7938   |     shared_tap     |     shared_tap     |       10       |       3       |
|  KiHa22748  |   43140   | tap_in_home_broken | tap_in_home_broken |       10       |       9       |
|  SoRu37841  |   18495   |     shared_tap     |     shared_tap     |       10       |       6       |
|  KiRu27884  |   33931   |        well        |        well        |       10       |       1       |
|  KiZu31170  |   17950   | tap_in_home_broken | tap_in_home_broken |       10       |       9       |
|  KiZu31370  |   36864   |     shared_tap     |     shared_tap     |       10       |       3       |
|  AkRu06495  |   45924   |        well        |        well        |       10       |       2       |
|  HaRu17528  |   30524   |        well        |        well        |       10       |       1       |
|  SoRu38331  |   13192   |     shared_tap     |     shared_tap     |       10       |       3       |
+-------------+-----------+--------------------+--------------------+----------------+---------------+
Truncated to displaylimit of 10.

 So what I can see is that the types of sources look the same! So even though the scores are wrong, the integrity of the type_of_water_source data we analysed last time is not affected

 Linking records to employees
lets look up for employees(surveyors) who filled the incorrect details

In [36]:
%%sql
    -- look up the surveyors from the employee table using the visits table to perfom the join
SELECT
    a.location_id,
    v.record_id,
    e.employee_name	AS surveyor_name,
    q.subjective_quality_score AS surveyor_score,
    a.true_water_source_score AS auditor_score --renamed
FROM
    auditor_report a
LEFT JOIN
    visits v 
    ON a.location_id = v.location_id
LEFT JOIN
    water_quality q 
    ON v.record_id = q.record_id
LEFT JOIN
    employee e
    ON e.assigned_employee_id = v.assigned_employee_id
WHERE 
   q.subjective_quality_score <> a.true_water_source_score
   AND v.visit_count =1;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

102 rows affected.

+-------------+-----------+----------------+----------------+---------------+
| location_id | record_id | surveyor_name  | surveyor_score | auditor_score |
+-------------+-----------+----------------+----------------+---------------+
|  AkRu05215  |   21160   |   Rudo Imani   |       10       |       3       |
|  KiRu29290  |    7938   |  Bello Azibo   |       10       |       3       |
|  KiHa22748  |   43140   |  Bello Azibo   |       10       |       9       |
|  SoRu37841  |   18495   |   Rudo Imani   |       10       |       6       |
|  KiRu27884  |   33931   |  Bello Azibo   |       10       |       1       |
|  KiZu31170  |   17950   | Zuriel Matembo |       10       |       9       |
|  KiZu31370  |   36864   | Yewande Ebele  |       10       |       3       |
|  AkRu06495  |   45924   |  Bello Azibo   |       10       |       2       |
|  HaRu17528  |   30524   | Jengo Tumaini  |       10       |       1       |
|  SoRu38331  |   13192   | Zuriel Matembo |       10       |       3       |
+-------------+-----------+----------------+----------------+---------------+
Truncated to displaylimit of 10.

In [48]:
%%sql
--create a CTE for the query selecting the surveryor who made the mistakes
WITH incorrect_records AS (
    SELECT
    a.location_id,
    v.record_id,
    e.employee_name	AS surveyor_name,
    q.subjective_quality_score AS surveyor_score,
    a.true_water_source_score AS auditor_score --renamed
    FROM
        auditor_report a
    LEFT JOIN
        visits v 
        ON a.location_id = v.location_id
    LEFT JOIN
        water_quality q 
        ON v.record_id = q.record_id
    LEFT JOIN
        employee e
        ON e.assigned_employee_id = v.assigned_employee_id
    WHERE 
       q.subjective_quality_score <> a.true_water_source_score
       AND v.visit_count =1
)
SELECT *
FROM incorrect_records

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

102 rows affected.

+-------------+-----------+----------------+----------------+---------------+
| location_id | record_id | surveyor_name  | surveyor_score | auditor_score |
+-------------+-----------+----------------+----------------+---------------+
|  AkRu05215  |   21160   |   Rudo Imani   |       10       |       3       |
|  KiRu29290  |    7938   |  Bello Azibo   |       10       |       3       |
|  KiHa22748  |   43140   |  Bello Azibo   |       10       |       9       |
|  SoRu37841  |   18495   |   Rudo Imani   |       10       |       6       |
|  KiRu27884  |   33931   |  Bello Azibo   |       10       |       1       |
|  KiZu31170  |   17950   | Zuriel Matembo |       10       |       9       |
|  KiZu31370  |   36864   | Yewande Ebele  |       10       |       3       |
|  AkRu06495  |   45924   |  Bello Azibo   |       10       |       2       |
|  HaRu17528  |   30524   | Jengo Tumaini  |       10       |       1       |
|  SoRu38331  |   13192   | Zuriel Matembo |       10       |       3       |
+-------------+-----------+----------------+----------------+---------------+
Truncated to displaylimit of 10.

In [50]:
%%sql
    --query the CTE by aggregating the count of mistakes commited by each employee
WITH incorrect_records AS (
    SELECT
        a.location_id,
        v.record_id,
        e.employee_name AS surveyor_name,
        q.subjective_quality_score AS surveyor_score,
        a.true_water_source_score AS auditor_score
    FROM
        auditor_report a
    LEFT JOIN
        visits v ON a.location_id = v.location_id
    LEFT JOIN
        water_quality q ON v.record_id = q.record_id
    LEFT JOIN
        employee e ON e.assigned_employee_id = v.assigned_employee_id
    WHERE
        q.subjective_quality_score <> a.true_water_source_score
        AND v.visit_count = 1
)
SELECT
    surveyor_name,
    COUNT(surveyor_name) AS mistakes
FROM incorrect_records
GROUP BY surveyor_name
ORDER BY mistakes DESC ;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

17 rows affected.

+----------------+----------+
| surveyor_name  | mistakes |
+----------------+----------+
|  Bello Azibo   |    26    |
| Malachi Mavuso |    21    |
| Zuriel Matembo |    17    |
| Lalitha Kaburi |    7     |
|   Rudo Imani   |    5     |
|   Farai Nia    |    4     |
|  Enitan Zuri   |    4     |
| Yewande Ebele  |    3     |
| Jengo Tumaini  |    3     |
|  Makena Thabo  |    3     |
+----------------+----------+
Truncated to displaylimit of 10.

the assumpion is that the surveyors can make these mistakes because of 2 reasons;
    a. human error
    b. intentional error
Because of disparity in the count of mistakes by employees its clear that some of these mistakes were not human errors, therefore its empirical to collect evidence to justify our latter conclusion

we follow a simple logical process to gather evidence as to whether employees making mistakes are corrupt;
1. is the number of mistakes done greater than average
2. what does the information on the statements column of auditors table say about the employees with more than average mistakes
~ by answering these questions, we will know whether the employees mistakes were really mistakes or were deliberate

In [70]:
%%sql
--calculate the average number_of_mistakes by defining another CTE and using it to calculate the avg frm it
WITH
incorrect_records AS (
    SELECT
        a.location_id,
        v.record_id,
        e.employee_name AS surveyor_name,
        q.subjective_quality_score AS surveyor_score,
        a.true_water_source_score AS auditor_score
    FROM
        auditor_report a
    LEFT JOIN visits v ON a.location_id = v.location_id
    LEFT JOIN water_quality q ON v.record_id = q.record_id
    LEFT JOIN employee e ON e.assigned_employee_id = v.assigned_employee_id
    WHERE
        q.subjective_quality_score <> a.true_water_source_score
        AND v.visit_count = 1
), -- define the another CTE called error_count to calculate the average from 
error_count AS (
    SELECT
        surveyor_name,
        COUNT(surveyor_name) AS number_of_mistakes
    FROM incorrect_records
    GROUP BY surveyor_name
)

SELECT
 AVG(number_of_mistakes)
 FROM
 error_count;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-------------------------+
| AVG(number_of_mistakes) |
+-------------------------+
|          6.0000         |
+-------------------------+

In [71]:
%%sql
--calculate the average number_of_mistakes by defining another CTE and using it to calculate the avg frm it
WITH
incorrect_records AS (
    SELECT
        a.location_id,
        v.record_id,
        e.employee_name AS surveyor_name,
        q.subjective_quality_score AS surveyor_score,
        a.true_water_source_score AS auditor_score
    FROM
        auditor_report a
    LEFT JOIN visits v ON a.location_id = v.location_id
    LEFT JOIN water_quality q ON v.record_id = q.record_id
    LEFT JOIN employee e ON e.assigned_employee_id = v.assigned_employee_id
    WHERE
        q.subjective_quality_score <> a.true_water_source_score
        AND v.visit_count = 1
), -- define the another CTE called error_count  
error_count AS (
    SELECT
        surveyor_name,
        COUNT(surveyor_name) AS number_of_mistakes
    FROM incorrect_records
    GROUP BY surveyor_name
)
-- find out the emplooyees with number_of_mistakes above average using the avg from the previous query
    SELECT
        surveyor_name,
        number_of_mistakes
    FROM
        error_count
    WHERE
       number_of_mistakes > 6 ;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

4 rows affected.

+----------------+--------------------+
| surveyor_name  | number_of_mistakes |
+----------------+--------------------+
|  Bello Azibo   |         26         |
| Zuriel Matembo |         17         |
| Malachi Mavuso |         21         |
| Lalitha Kaburi |         7          |
+----------------+--------------------+

Create a VIEW to replace the

In [ ]:
%%sql
    -- create a view recording everything about this employees and inlude the statements from the auditors
CREATE VIEW Incorrect_records AS (
 SELECT
 a.location_id,
 v.record_id,
 e.employee_name,
 a.true_water_source_score AS auditor_score,
 q.subjective_quality_score AS surveyor_score,
 a.statements AS statements
 FROM
 auditor_report a
 JOIN
 visits v
 ON a.location_id = v.location_id
 JOIN
 water_quality AS q
 ON v.record_id = q.record_id
 JOIN
 employee e
 ON e.assigned_employee_id = v.assigned_employee_id
 WHERE
 v.visit_count =1
 AND a.true_water_source_score != q.subjective_quality_score);

In [75]:
%%sql
    -- query the view
SELECT * FROM Incorrect_records

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

102 rows affected.

+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| location_id | record_id | employee_name  | auditor_score | surveyor_score |                                                                                         statements                                                                                        |
+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|  AkRu05215  |   21160   |   Rudo Imani   |       3       |       10       |                                          Villagers admired the official's visit for its respectful interactions, hard work, and genuine concern.                                          |
|  KiRu29290  |    7938   |  Bello Azibo   |       3       |       10       |                                      A young artist sketches the faces in the queue, capturing the weariness of daily hours spent waiting for water.                                      |
|  KiHa22748  |   43140   |  Bello Azibo   |       9       |       10       |                                            A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system.                                            |
|  SoRu37841  |   18495   |   Rudo Imani   |       6       |       10       |                           The official's respectful and diligent presence was met with heartfelt appreciation, creating a sense of closeness with the villagers.                          |
|  KiRu27884  |   33931   |  Bello Azibo   |       1       |       10       |                                           A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community.                                          |
|  KiZu31170  |   17950   | Zuriel Matembo |       9       |       10       |                                     A community leader stood with his people, expressing concern for the water quality and the time lost in queues.","                                    |
|  KiZu31370  |   36864   | Yewande Ebele  |       3       |       10       |                                  With a keen understanding of urban challenges, the official's visit left a lasting impression of respect and commitment.                                 |
|  AkRu06495  |   45924   |  Bello Azibo   |       2       |       10       |                                        A healthcare worker in the queue expressed fears about water-borne diseases, her face etched with worry.","                                        |
|  HaRu17528  |   30524   | Jengo Tumaini  |       1       |       10       |                                    With humility and diligence, the official formed bonds with the villagers that felt like genuine family connections.                                   |
|  SoRu38331  |   13192   | Zuriel Matembo |       3       |       10       | An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts. |
+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

Explore creating a CTE from the view created above to calculate the previous calculations
of number_of_mistakes and avg of the number_of_mistakes

In [76]:
%%sql
-- This CTE calculates the number of mistakes each employee made
WITH error_count AS (
    SELECT employee_name,
    COUNT(employee_name) AS number_of_mistakes
    FROM
        Incorrect_records
     /* Incorrect_records is a view that joins the audit report to the database for records where the auditor and
     employees scores are different*/
    GROUP BY employee_name
    )
        
    SELECT * 
    FROM error_count;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

17 rows affected.

+----------------+--------------------+
| employee_name  | number_of_mistakes |
+----------------+--------------------+
|   Rudo Imani   |         5          |
|  Bello Azibo   |         26         |
| Zuriel Matembo |         17         |
| Yewande Ebele  |         3          |
| Jengo Tumaini  |         3          |
|   Farai Nia    |         4          |
| Malachi Mavuso |         21         |
|  Makena Thabo  |         3          |
| Lalitha Kaburi |         7          |
|  Gamba Shani   |         3          |
+----------------+--------------------+
Truncated to displaylimit of 10.

In [77]:
%%sql
-- Now calculate the average of the number_of_mistakes in error_count
WITH error_count AS (
    SELECT employee_name,
    COUNT(employee_name) AS number_of_mistakes
    FROM Incorrect_records
    GROUP BY employee_name
    )
SELECT
    AVG(number_of_mistakes)
FROM
   error_count;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-------------------------+
| AVG(number_of_mistakes) |
+-------------------------+
|          6.0000         |
+-------------------------+

In [4]:
%%sql
-- Select employees with mistakes > average
WITH error_count AS (
    SELECT employee_name,
    COUNT(employee_name) AS number_of_mistakes
    FROM Incorrect_records
    GROUP BY employee_name
    )
SELECT
    employee_name,
    number_of_mistakes
FROM
   error_count
WHERE
   number_of_mistakes > 6 ;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

4 rows affected.

+----------------+--------------------+
| employee_name  | number_of_mistakes |
+----------------+--------------------+
|  Bello Azibo   |         26         |
| Zuriel Matembo |         17         |
| Malachi Mavuso |         21         |
| Lalitha Kaburi |         7          |
+----------------+--------------------+

In [82]:
%%sql
-- select the incorrect table view
SELECT 
    *
FROM
    incorrect_records

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

102 rows affected.

+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| location_id | record_id | employee_name  | auditor_score | surveyor_score |                                                                                         statements                                                                                        |
+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|  AkRu05215  |   21160   |   Rudo Imani   |       3       |       10       |                                          Villagers admired the official's visit for its respectful interactions, hard work, and genuine concern.                                          |
|  KiRu29290  |    7938   |  Bello Azibo   |       3       |       10       |                                      A young artist sketches the faces in the queue, capturing the weariness of daily hours spent waiting for water.                                      |
|  KiHa22748  |   43140   |  Bello Azibo   |       9       |       10       |                                            A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system.                                            |
|  SoRu37841  |   18495   |   Rudo Imani   |       6       |       10       |                           The official's respectful and diligent presence was met with heartfelt appreciation, creating a sense of closeness with the villagers.                          |
|  KiRu27884  |   33931   |  Bello Azibo   |       1       |       10       |                                           A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community.                                          |
|  KiZu31170  |   17950   | Zuriel Matembo |       9       |       10       |                                     A community leader stood with his people, expressing concern for the water quality and the time lost in queues.","                                    |
|  KiZu31370  |   36864   | Yewande Ebele  |       3       |       10       |                                  With a keen understanding of urban challenges, the official's visit left a lasting impression of respect and commitment.                                 |
|  AkRu06495  |   45924   |  Bello Azibo   |       2       |       10       |                                        A healthcare worker in the queue expressed fears about water-borne diseases, her face etched with worry.","                                        |
|  HaRu17528  |   30524   | Jengo Tumaini  |       1       |       10       |                                    With humility and diligence, the official formed bonds with the villagers that felt like genuine family connections.                                   |
|  SoRu38331  |   13192   | Zuriel Matembo |       3       |       10       | An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts. |
+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

In [5]:
%%sql
-- Select employees with mistakes > average
WITH error_count AS (
    SELECT employee_name,
    COUNT(employee_name) AS number_of_mistakes
    FROM incorrect_records
    GROUP BY employee_name
    ),-- Create a suspects_list CTE
suspect_list AS( 
    SELECT
    employee_name,
    number_of_mistakes
    FROM
    error_count
    WHERE
    number_of_mistakes > 6 )
-- Query the suspect list to get the names of the suspects
SELECT
    *
 FROM
 Incorrect_records
 WHERE
 employee_name IN (SELECT employee_name FROM suspect_list)

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

71 rows affected.

+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| location_id | record_id | employee_name  | auditor_score | surveyor_score |                                                                                         statements                                                                                        |
+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|  KiRu29290  |    7938   |  Bello Azibo   |       3       |       10       |                                      A young artist sketches the faces in the queue, capturing the weariness of daily hours spent waiting for water.                                      |
|  KiHa22748  |   43140   |  Bello Azibo   |       9       |       10       |                                            A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system.                                            |
|  KiRu27884  |   33931   |  Bello Azibo   |       1       |       10       |                                           A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community.                                          |
|  KiZu31170  |   17950   | Zuriel Matembo |       9       |       10       |                                     A community leader stood with his people, expressing concern for the water quality and the time lost in queues.","                                    |
|  AkRu06495  |   45924   |  Bello Azibo   |       2       |       10       |                                        A healthcare worker in the queue expressed fears about water-borne diseases, her face etched with worry.","                                        |
|  SoRu38331  |   13192   | Zuriel Matembo |       3       |       10       | An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts. |
|  AmAm09607  |   55067   | Malachi Mavuso |       9       |       10       |       Villagers spoke of an unsettling encounter with an official who appeared dismissive and detached. The reference to cash transactions added to their growing sense of distrust.      |
|  AkHa00314  |   29407   | Zuriel Matembo |       9       |       10       |                                    A street vendor's sales suffer from time spent waiting, her concern for the water's quality affecting her products.                                    |
|  KiRu26598  |   28874   | Malachi Mavuso |       9       |       10       |                                      A teenager's dreams are tempered by reality, her future threatened by the corrupt practices she sees around her.                                     |
|  KiIs23853  |   55796   |  Bello Azibo   |       2       |       10       |       Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The mention of cash changing hands further tainted their perception.      |
+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

In [6]:
%%sql
-- select records with cash in statements column from the suspects list
WITH error_count AS (
    SELECT employee_name,
    COUNT(employee_name) AS number_of_mistakes
    FROM incorrect_records
    GROUP BY employee_name
    ),-- Create a suspects_list CTE
suspect_list AS( 
    SELECT
    employee_name,
    number_of_mistakes
    FROM
    error_count
    WHERE
    number_of_mistakes > 6 )
-- Query the suspect list to get the names of the suspects
SELECT
    *
 FROM
 Incorrect_records
 WHERE
 employee_name IN (SELECT employee_name FROM suspect_list)
    AND statements LIKE "%cash%"; --selects statements with word cash init

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

19 rows affected.

+-------------+-----------+----------------+---------------+----------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| location_id | record_id | employee_name  | auditor_score | surveyor_score |                                                                                              statements                                                                                              |
+-------------+-----------+----------------+---------------+----------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|  SoRu38331  |   13192   | Zuriel Matembo |       3       |       10       |      An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts.       |
|  AmAm09607  |   55067   | Malachi Mavuso |       9       |       10       |            Villagers spoke of an unsettling encounter with an official who appeared dismissive and detached. The reference to cash transactions added to their growing sense of distrust.            |
|  KiIs23853  |   55796   |  Bello Azibo   |       2       |       10       |            Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The mention of cash changing hands further tainted their perception.            |
|  HaSe21323  |   26260   |  Bello Azibo   |       3       |       10       |            Villagers spoke of an unsettling encounter with an official who appeared dismissive and detached. The reference to cash transactions added to their growing sense of distrust.            |
|  AkRu05880  |   12705   | Zuriel Matembo |       7       |       10       |               Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The allusion to cash changing hands deepened their skepticism.               |
|  KiRu27065  |   29772   |  Bello Azibo   |       0       |       10       |           Villagers expressed their discomfort with an official who displayed a haughty demeanor and negligence. The mention of cash transactions deepened their growing sense of unease.            |
|  KiRu25347  |   54560   | Malachi Mavuso |       2       |       10       |              Villagers expressed their discontent with an official who appeared dismissive and neglectful. The mention of cash changing hands added to their growing sense of distrust.              |
|  SoIl32575  |    3116   | Zuriel Matembo |       1       |       10       | Villagers recounted unsettling encounters with an official known for their arrogance and avoidance of responsibilities. The mention of cash changing hands added to their apprehension and distrust. |
|  AkRu04508  |   37357   |  Bello Azibo   |       1       |       10       |      An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts.       |
|  AkRu07310  |   37457   | Lalitha Kaburi |       9       |       10       |                Villagers spoke of their unsettling encounters with an official who seemed indifferent and uninterested, hinting at potential improprieties involving cash exchanges.                 |
+-------------+-----------+----------------+---------------+----------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

In [7]:
%%sql
-- check if there are employees not in suspects list with word 'cash' in the statements column
WITH error_count AS (
    SELECT employee_name,
    COUNT(employee_name) AS number_of_mistakes
    FROM incorrect_records
    GROUP BY employee_name
    ),-- Create a suspects_list CTE
suspect_list AS( 
    SELECT
    employee_name,
    number_of_mistakes
    FROM
    error_count
    WHERE
    number_of_mistakes > 6 )
-- Query the suspect list to get the names of the suspects
SELECT
    *
 FROM
 Incorrect_records
 WHERE
 employee_name NOT IN (SELECT employee_name FROM suspect_list)-- Add NOT in the filter out employees in suspects list
    AND statements LIKE "%cash%";

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+-------------+-----------+---------------+---------------+----------------+------------+
| location_id | record_id | employee_name | auditor_score | surveyor_score | statements |
+-------------+-----------+---------------+---------------+----------------+------------+
+-------------+-----------+---------------+---------------+----------------+------------+

So we can sum up the evidence we have for Zuriel Matembo, Malachi Mavuso, Bello Azibo and Lalitha Kaburi:
                                      
 1. They all made more mistakes than their peers on average.
                                      
 2. They all have incriminating statements made against them, and only them.